"""
NLP
Taskflow参数如下：
- schema：定义任务抽取目标，可参考开箱即用中不同任务的调用示例进行配置。
- schema_lang：设置schema的语言，默认为zh, 可选有zh和en。因为中英schema的构造有所不同，因此需要指定schema的语言。
                该参数只对uie-m-base和uie-m-large模型有效。
- batch_size：批处理大小，请结合机器情况进行调整，默认为1。
- model：选择任务使用的模型，默认为uie-base，可选有uie-base, uie-medium, uie-mini, uie-micro, uie-nano和uie-medical-base, uie-base-en。
- position_prob：模型对于span的起始位置/终止位置的结果概率在0~1之间，返回结果去掉小于这个阈值的结果，默认为0.5，span的最终概率输出为起始位置概率和终止位置概率的乘积。
- precision：选择模型精度，默认为fp32，可选有fp16和fp32。fp16推理速度更快，只支持GPU和NPU硬件环境。
- use_fast: 使用C++实现的高性能分词算子FastTokenizer进行文本预处理加速。
            需要通过pip install fast-tokenizer-python安装FastTokenizer库后方可使用。
            默认为False。更多使用说明可参考FastTokenizer文档。
"""
import logging
import copy
from paddlenlp import Taskflow
from app_tools import common
from app_tools import settings


# TODO 这两句目前看着没用后续换好机子后再测试
# import fast_tokenizer
# # 0.（可选）设置线程数
# fast_tokenizer.set_thread_num(8)

logger = logging.getLogger(__name__)

ie = Taskflow('information_extraction',
              model='uie-base',
              schema=['开户行', ],
              task_path=settings.UIE_BASE_MODEL_DIR,
              batch_size=10,  # TODO 换机子后测试
              use_fast=True
              )


def get_coordinate(ocr_result: list, value: str):
    """
    用字符串去匹配OCR的识别结果，遇到相同的就把位置信息
    :param ocr_result: ocr的识别结果
    :param value: 要查询位置的文本字符串
    :return:(左上，右下)的坐标
    """
    for line in ocr_result:
        txt = line[1][0]
        if settings.new_line in value:
            value = value.split(settings.new_line)[0]  # '中国建设银行股份有限公司\n海口海秀路支行'  ---这样情况的暂不处理，只返回第一段的位置
        if value in txt:
            top_left = (int(eval(f"{line[0][0][0]}")),
                        int(eval(f"{line[0][0][1]}")))
            bottom_right = (int(eval(f"{line[0][2][0]}")),
                            int(eval(f"{line[0][2][1]}")))
            res = (top_left, bottom_right)
            return res
    return None


def nlp_result_to_list(ocr_result: list[list], nlp_result: list[dict]) -> list[str]:
    """
    根据
    :param ocr_result: OCR的识别结果
    :param nlp_result: NLP的识别结果
    :return:
    """
    nlp_result = copy.deepcopy(nlp_result)
    for res in nlp_result:
        for key in res.keys():  # 关键字
            for value in res[key]:  # 内容列表
                del value['start']
                del value['end']
                value['position'] = get_coordinate(ocr_result=ocr_result, value=value['text'])
    return nlp_result


def ocr_to_text(result):
    # 遍历OCR的识别结果result，转为只有内容的纯文本
    txts = []
    for line in result:
        txt = line[1][0]  # line[1][0]识别内容，其它的位置，置信度都不要
        if isinstance(txt, list):
            txt = ' '.join(txt)
        txts.append(txt)
    all_text = settings.new_line.join(txts)
    return all_text


@common.nc_time
def match_keyword(text: str, keywords: list[str]):
    """
    NLP
    :param text: 文本内容
    :param keywords:  关系关键字列表
    :return:
    """
    #   NLP关键信息抽取
    logging.info(f"要抽取的关系文本：[{text}]")
    logging.info(f"要抽取的keywords：[{keywords}]")
    schema = keywords
    ie.set_schema(schema)
    nlp_result = ie(text)
    return nlp_result


if __name__ == '__main__':
    def test():
        keywords = {"买方": ["买方", "甲方"],
                    "卖方": ["卖方", "乙方"],
                    "总价": ["总价", "价格", "小写"],
                    "税率": ["税率"],
                    "纳税人识别号": ["纳税人识别号"],
                    "开户行": ["开户行"],
                    "住所地": ["住所地"],
                    "合同自编号": ["合同自编号"],
                    "签订日期": ["签订日期"],
                    "采购订单号": ["采购订单号"],
                    "工程名称": ["工程名称"],
                    "法定代表(负责)人": ["法定代表"]}
        from ocr.ocr import paddle_ocr

        with open(r'C:\Users\issuser\Desktop\30114645z7cj.jpeg', 'rb') as f:
            image_file = f.read()
            image_name = f.name
        result = paddle_ocr(image_file=image_file, image_name=image_name)
        print(result)
        text = ocr_to_text(result[0])
        print('####################')
        print(text)
        print('####################')
        keywords = ['买方', '卖方', '总价', '税率', '纳税人识别号', '开户行', '住所地', '合同自编号', '签订日期', '采购订单号', '工程名称', '法定代表(负责)人']
        s = match_keyword(text, keywords)
        print(s)
        print(type(s))
        s = match_keyword(text, keywords)
        get_coordinate(result)
        print(s)
        print(type(s))


    text = """
        可向甲方所在地人民法院提起诉讼。
    八、其他
    1、本合同未尽事宜双方可签订补充协议，补充协议与本合同具有同等法律效
    力。
    2、本合同一式六份，中文书写。公共资源交易服务中心一份、招标代理机构
    一份、甲方二份、乙方二份。合同自甲乙双方签字盖章之日起生效。
    甲方：三亚市崖州区国有资产管理
    乙方：海南神铨汽车销售有限公司(签章)
    开发有限责任公司（章)
    合同专用章
    地址：
    地址：海南省海口山市龙华区丘海大道苍
    西村导谭地块8号8-1铺面
    邮编：
    邮编：570311
    开户行：
    开户行：中国建设银行股份有限公司
    海口海秀路支行
    账号：
    账号：46001007336052505452
    电话：
    电话：0898-33585565
    传真：
    传真：0898-3358556
    授权代表签字：1
    授权代表签字：
    签订时间：
    7017. 9. 6
    签订时间：
    鉴证方（盖章）河南省天隆工程管理咨询有限公司
    日期：29
        """
    keywords = ['买方', '卖方', '总价', '税率', '纳税人识别号', '开户行', '住所地', '合同自编号', '签订日期', '采购订单号', '工程名称', '法定代表(负责)人']
    s = match_keyword(text, keywords)
    print(s)

    ocr_result = [
        [[[424.0, 318.0], [1196.0, 325.0], [1195.0, 376.0], [424.0, 369.0]], ('可向甲方所在地人民法院提起诉讼。', 0.9537599086761475)],
        [[[420.0, 416.0], [654.0, 416.0], [654.0, 479.0], [420.0, 479.0]], ('八、其他', 0.9996351003646851)],
        [[[467.0, 540.0], [2151.0, 559.0], [2151.0, 610.0], [467.0, 592.0]],
         ('1、本合同未尽事宜双方可签订补充协议，补充协议与本合同具有同等法律效', 0.9544804692268372)],
        [[[567.0, 639.0], [643.0, 639.0], [643.0, 698.0], [567.0, 698.0]], ('力。', 0.9650946259498596)],
        [[[460.0, 727.0], [2151.0, 749.0], [2150.0, 808.0], [459.0, 785.0]],
         ('2、本合同一式六份，中文书写。公共资源交易服务中心一份、招标代理机构', 0.934851884841919)],
        [[[568.0, 829.0], [2036.0, 844.0], [2036.0, 895.0], [567.0, 880.0]],
         ('一份、甲方二份、乙方二份。合同自甲乙双方签字盖章之日起生效。', 0.9825571775436401)],
        [[[453.0, 1103.0], [1207.0, 1115.0], [1206.0, 1188.0], [452.0, 1176.0]],
         ('甲方：三亚市崖州区国有资产管理', 0.9233935475349426)],
        [[[1275.0, 1118.0], [2148.0, 1129.0], [2147.0, 1191.0], [1274.0, 1180.0]],
         ('乙方：海南神铨汽车销售有限公司(签章)', 0.988368570804596)],
        [[[651.0, 1191.0], [1200.0, 1199.0], [1199.0, 1272.0], [650.0, 1264.0]], ('开发有限责任公司（章)', 0.9149083495140076)],
        [[[825.0, 1265.0], [1107.0, 1248.0], [1111.0, 1314.0], [828.0, 1331.0]], ('合同专用章', 0.9233671426773071)],
        [[[452.0, 1293.0], [585.0, 1293.0], [585.0, 1359.0], [452.0, 1359.0]], ('地址：', 0.8159237504005432)],
        [[[1282.0, 1293.0], [2151.0, 1301.0], [2151.0, 1374.0], [1282.0, 1366.0]],
         ('地址：海南省海口山市龙华区丘海大道苍', 0.9155299663543701)],
        [[[1559.0, 1399.0], [2144.0, 1407.0], [2143.0, 1469.0], [1558.0, 1461.0]],
         ('西村导谭地块8号8-1铺面', 0.8948348760604858)],
        [[[452.0, 1487.0], [585.0, 1487.0], [585.0, 1553.0], [452.0, 1553.0]], ('邮编：', 0.9528427124023438)],
        [[[1282.0, 1505.0], [1584.0, 1505.0], [1584.0, 1556.0], [1282.0, 1556.0]], ('邮编：570311', 0.9989590048789978)],
        [[[452.0, 1585.0], [632.0, 1585.0], [632.0, 1651.0], [452.0, 1651.0]], ('开户行：', 0.9797369241714478)],
        [[[1279.0, 1593.0], [2079.0, 1604.0], [2079.0, 1662.0], [1278.0, 1651.0]],
         ('开户行：中国建设银行股份有限公司', 0.9266223907470703)],
        [[[1609.0, 1702.0], [1957.0, 1702.0], [1957.0, 1754.0], [1609.0, 1754.0]], ('海口海秀路支行', 0.9705217480659485)],
        [[[449.0, 1779.0], [582.0, 1779.0], [582.0, 1845.0], [449.0, 1845.0]], ('账号：', 0.9918897747993469)],
        [[[1279.0, 1790.0], [1939.0, 1798.0], [1939.0, 1852.0], [1278.0, 1845.0]],
         ('账号：46001007336052505452', 0.9502102136611938)],
        [[[449.0, 1874.0], [578.0, 1874.0], [578.0, 1940.0], [449.0, 1940.0]], ('电话：', 0.9515592455863953)],
        [[[1282.0, 1888.0], [1749.0, 1896.0], [1748.0, 1947.0], [1282.0, 1940.0]],
         ('电话：0898-33585565', 0.9974571466445923)],
        [[[449.0, 1973.0], [578.0, 1973.0], [578.0, 2038.0], [449.0, 2038.0]], ('传真：', 0.9831674098968506)],
        [[[1272.0, 1979.0], [1721.0, 1991.0], [1719.0, 2054.0], [1271.0, 2042.0]],
         ('传真：0898-3358556', 0.994525671005249)],
        [[[450.0, 2067.0], [812.0, 2075.0], [811.0, 2138.0], [448.0, 2129.0]], ('授权代表签字：1', 0.8975439071655273)],
        [[[1278.0, 2086.0], [1591.0, 2086.0], [1591.0, 2137.0], [1278.0, 2137.0]], ('授权代表签字：', 0.9965815544128418)],
        [[[449.0, 2170.0], [675.0, 2170.0], [675.0, 2232.0], [449.0, 2232.0]], ('签订时间：', 0.9024900197982788)],
        [[[756.0, 2179.0], [1042.0, 2161.0], [1046.0, 2238.0], [761.0, 2255.0]], ('7017. 9. 6', 0.8029358983039856)],
        [[[1278.0, 2181.0], [1494.0, 2181.0], [1494.0, 2232.0], [1278.0, 2232.0]], ('签订时间：', 0.9883166551589966)],
        [[[396.0, 2469.0], [1508.0, 2484.0], [1508.0, 2547.0], [395.0, 2531.0]],
         ('鉴证方（盖章）河南省天隆工程管理咨询有限公司', 0.9759469628334045)],
        [[[399.0, 2568.0], [955.0, 2568.0], [955.0, 2645.0], [399.0, 2645.0]], ('日期：29', 0.8185939788818359)]]

    NLP_RESULT = [{'甲方': [{'text': '三亚市崖州区国有资产管理', 'start': 129, 'end': 141, 'probability': 0.9164909148587697}],
                   '乙方': [{'text': '海南神铨汽车销售有限公司(签章)\n开发有限责任公司', 'start': 145, 'end': 170,
                           'probability': 0.5705488173078592}], '开户行': [
            {'text': '中国建设银行股份有限公司\n海口海秀路支行', 'start': 240, 'end': 260, 'probability': 0.8204746396851554}],
                   '签订日期': [{'text': '7017. 9. 6', 'start': 353, 'end': 363, 'probability': 0.8123617228616666}]}]
